Repository: edutec/s4aWeb
Catalog: devdocs/s4aWeb-translation-ES/s4aWeb-translation-ES-level1.tmx
Source language: ca
Languages: es

source: No és possible obrir projectes de S4A des de l'Scratch original.
es: No es posible abrir proyectos de S4A desde el Scratch original.

source: Des d'aquí podeu descarregar-vos un zip amb materials i exercicis complets per a realitzar un taller:
es: Desde aquí podéis descargaros un zip con materiales y ejercicios completos para realizar un taller:

source: Connectivitat
es: Conectividad

source: Els missatges S4A amb noms que no comencin amb un signe més no són visibles des del client web
es: Los mensajes de S4A con nombres que no empiecen con un signo más no son visibles desde el cliente web

source: Especificació del protocol S4A
es: Especificación del protocolo S4A

source: Arreglat bug relacionat amb un error persistent en aturar i reemprendre la connexió amb la placa
es: Arreglado bug relacionado con un error persistente al parar y reanudar la conexión con la placa

source: Per aquest motiu, també distribuïm una imatge amb el codi font net per a desenvolupadors, descarregable des d'aquest enllaç:
es: Por este motivo, también distribuimos una imagen con el código fuente limpio para desarrolladores, descargable desde este enlace:

source: Tingueu en compte que, per a treballar amb Arduino Uno, us caldrà la versió 0022 o superior.
es: Hay que tener en cuenta que, para trabajar con Arduino Uno, se necesita la versión 0022 o superior.

source: Robòtica: Un cotxe controlat per teclat
es: Robótica: Un coche controlado por teclado

source: La necessitat d'analitzar l'informació generada i les dades recollides va instigar el seu apropament a l'informàtica.
es: La necesidad de analizar la información generada y los datos recogidos instigó su aproximación a la informática.

source: Molts bug arreglats
es: Muchos bug arreglados

source: Per a instal·lar S4A, cal instal·lar software tan al PC com a la placa Arduino.
es: Para instalar S4A, hay que instalar software tanto en el PC como en la placa Arduino.

source: Descarregueu el nostre firmware aquí
es: Descargad nuestro firmware aquí

source: Connecteu la placa Arduino a un port USB del vostre ordinador
es: Conectad la placa Arduino a un puerto USB de vuestro ordenador

source: S4A funciona sobre els tres sistemes operatius d'escriptori més populars.
es: S4A funciona sobre los tres sistemas operativos de escritorio más populares.

source: És membre de la mesa de la European Smalltalk Users Group (ESUG) i president de l'associació Smalltalk.cat.
es: Es miembro de la mesa de la European Smalltalk Users Group (ESUG) y presidente de la associación Smalltalk.cat.

source: També hi trobareu blocs per a tractar amb motors estàndard i servomotors de rotació contínua.
es: También encontraréis bloques para tratar con motores estándar y servomotores de rotación contínua.

source: Un programa de S4A per a controlar un Theremin de llum, amb capacitat de gravació i reproducció
es: Un programa de S4A para controlar un Theremin de luz, con capacidad de grabación y reproducción

source: Com que Scratch és, en realitat, una imatge d'Squeak Smalltalk, tot el seu codi ve inclòs en la versió final.
es: Como Scratch es, en realidad, una imagen de Squeak Smalltalk, todo su código viene incluido en la versión final.

source: Exercicis
es: Ejercicios

source: Els missatges S4A amb noms que comencin amb un signe més (ex.
es: Los mensajes de S4A con nombres que empiecen con un signo más (ej.

source: S4A és compatible amb Scratch, de manera que és possible obrir projectes d'Scratch des de S4A.
es: S4A es compatible con Scratch, de forma que es posible abrir proyectos de Scratch desde S4A.

source: S4A - Scratch for Arduino és una modificació d'Scratch que porta la facilitat de programar en Scratch a la placa de prototipatge Arguino
es: S4A - Scratch for Arduino es una modificación de Scratch que trae la facilidad de programar en Scratch a la placa de prototipaje Arguino

source: http://[IP]:42001/sensor-update=[nom-del-sensor]=[valor]
es: http://[IP]:42001/sensor-update=[nombre-del-sensor]=[valor]

source: Polsador i LED
es: Pulsador y LED

source: Més endavant, es va unir a diversos projectes amb l'objectiu d'establir una relació més propera entre els usuaris i la programació.
es: Más adelante, se unió a varios proyectos con el objetivo de establecer una relación más cercana entre los usuarios y la programación.

source: Codi
es: Código

source: En Víctor va començar a estudiar Enginyeria en Informàtica a la Universitat Autònoma de Barcelona (UAB), però després de dos anys va passar a estudiar el grau de telecomunicacions a l'Escola Politècnica Superior de Castelldefels.
es: Víctor empezó a estudiar Ingeniería en Informática en la Universitat Autònoma de Barcelona (UAB), pero al cabo de dos años pasó a estudiar el grado de telecomunicaciones en la Escola Politècnica Superior de Castelldefels.

source: L'intercanvi de dades segueix el protocol PicoBoard, i necessita que s'instal·li un programa específic (firmware) a la placa.
es: El intercambio de datos sigui el protocolo PicoBoard, y necesita que se instale un programa específico (firmware) en la placa.

source: Scratch es va desenvolupar en Squeak Smalltalk per l'Institut Tecnològic de Massachussets (MIT).
es: Scratch fue desarrollado en Squeak Smalltalk por el Instituto Tecnológico de Massachussets (MIT).

source: http://[IP]:42001/vars-update=[nom-de-la-variable]=[valor]
es: http://[IP]:42001/vars-update=[nombre-de-la-variable]=[valor]

source: També podeu utilitzar la interfície web de la llista de correu per a subscriure-us, contribuir i consultar l'arxiu:
es: También podéis utilizar la interfaz web de la lista de correo para suscribiros, contribuir y consultar el archivo:

source: S4A ha estat desenvolupat al Citilab per l'equip de recerca Edutech, amb l'ajuda del grup de programació Smalltalk.cat i de col·laboradors com Jorge Gómez, cap del projecte d'educació en software i hardware a Miscela.
es: S4A ha sido desarrollado en el Citilab por el equivo de investigación Edutech, con la ayuda del grupo de programación Smalltalk.cat y de colaboradores como Jorge Gómez, jefe del proyecto de educación en software y hardware a Miscela

source: Comunitat
es: Comunidad

source: Aquest vídeo serveix com a introducció pels tallers d'S4A que s'imparteixen al Citilab.
es: Este vídeo sirve como introducción para los talleres de S4A que se imparten en el Citilab.

source: També compta amb un panell de sensors similar al de la PicoBoard.
es: También cuenta con un panel de sensores similar al de la PicoBoard.

source: Va aprendre Smalltalk en un curs impartit per Jordi Delgado al Citilab durant l'any 2008, on més endavant va entrar a treballar amb l'objectiu de desenvolupar una escola virtual de programació.
es: Aprendió Smalltalk en un curso impartido pir Jordi Delgado en el Citilab durante el año 2008, donde más adelante entró a trabajar con el objetivo de desarrollar una escuela virtual de programación.

source: En Jordi és professor titular al departament de Llenguatges i Sistemes Informàtics de la Universitat Politècnica de Catalunya (UPC).
es: Jordi es profesor titular en el departamento de Lenguajes y Sistemas Informáticos de la Universitat Politècnica de Catalunya (UPC).

source: Instal·lar S4A a l'ordinador
es: Instalar S4A en el ordenador

source: Acualment, és el cap de l'equip de recerca en educació tecnològica Edutec.
es: Acualmente, es el responsable del equipo de investigación en educación tecnológica Edutec.

source: Un joc de nens!
es: Un juego de niños!

source: S4A permet utilitzar una PicoBoard conjuntament amb un Arduino.
es: S4A permite utilizar una PicoBoard conjuntamente con un Arduino.

source: Instal·lar el firmware a Arduino
es: Instalar el firmware en el Arduino

source: http://[IP]:42001/broadcast=[nom-del-missatge]
es: http://[IP]:42001/broadcast=[nombre-del-mensaje]

source: Ençallos externs de documentació
es: Enlaces externos de documentación

source: Al menú Tools, seleccioneu la versió de la placa i el port sèrie en què heu connectat la placa
es: En el menú Tools, seleccionad la versión de la placa y el puero serie en qué esté conectada la placa

source: Hem desenvolupat una aplicació simple d'Android que pot comunicar-se amb S4A via HTTP mitjançant el protocol de sensors remots d'Scratch.
es: Hemos desarrollado una aplicación simple de Android que puede comunicarse con S4A via HTTP mediante el protocolo de sensores remotos de Scratch.

source: Exemples Bàsics
es: Ejemplos Básicos

source: La seva tasca principal al Citilab ha estat relacionada amb el camp de la formació en dues àrees: l'ensenyament de la programació mitjançant Scratch, especialment per a nens, i la formació en coneixements d'informàtica a ciutadans adults.
es: Su principal tarea en el Citilab ha estado relacionada con el campo de la formación en dos áreas: la enseñanza de la programación mediante Scratch, especialmente para niños, y la formación en conocimientos de informática a ciudadanos adultos.

source: -puntuacioJugador) només són visibles (no modificables) des del client web
es: -puntuacionJugador) sólo son visibles y modificables desde el cliente web

source: S4A per a desenvolupadors
es: S4A para desarrolladores

source: S4A és una modificació d'Scratch que permet programar la plataforma de hardware lliure Arduino d'una manera senzilla.
es: S4A es una modificación de Scratch que permite programar la plataforma de hardware libre Arduino de una forma sencilla.

source: Arreglat bug de col·lisió entre objectes (Arduino i no Arduino)
es: Arreglado bug de colisión entre objetos (Arduino y no Arduino)

source: Música: Un instrument similar a un theremin
es: Música: Un instrumento similar a un theremin

source: Com utilitzar l'entrada d'un fotoresistor per a activar un LED.
es: Como usar la entrada de un fotoresistor para activar un LED.

source: Un altre objectiu és proporcionar una interfície d'alt nivell per a programadors d'Arduino amb funcionalitats tals com la interacció amb un conjunt de plaques mitjançant esdeveniments d'usuari.
es: Otro de sus objetivos es proporcionar una interfaz de alto nivel para programadores de Arduino con funcionalidades tales como la interacción con un conjunto de placas mediante eventos de usuario.

source: Aquest firmware és un programa que cal instal·lar a la vostra placa Arduino per tal de poder-vos-hi comunicar des d'S4A.
es: Este firmware es un programa que debe instalarse en vuestra placa Arduino para poderos comunicar con ella desde S4A.

source: Pàgina web de la llista de correu
es: Página web de la lista de correo

source: index_es.html
es: index_ca.html

source: Versió 1.5
es: Versión 1.5

source: des del Web
es: desde el Web

source: Versió 1.3
es: Versión 1.3

source: Versió 1.4
es: Versión 1.4

source: Scratch IO Wiki - per José Javier Vitón
es: Scratch IO Wiki - por José Javier Vitón

source: En qualsevol cas, no és possible compartir projectes de S4A a la web de la comunitat Scratch, ja que això aniria en contra del termes i condicions d'ús d'Scratch.
es: En cualquier caso, no es posible compartir proyectos de S4A en la web de la comunidad Scratch, ya que ésto violaría los términos y condiciones de uso de Scratch.

source: Inverteix la major part del seu temps en divulgar, difondre la idea i programar en Smalltalk, un llenguatge de programació apassionant que considera que tothom hauria d'utilitzar.
es: Invierte la mayor parte de su tiempo en divulgar, difundir la idea y programar en Smalltalk, un lenguaje de programación apassionante que considera que todo el mundo debería usar.

source: Actualitzar una variable de S4A:
es: Actualizar una variable de S4A:

source: Descarregueu i instal·leu el que us convingui.
es: Descargad e instalad el que os convenga.

source: Introducció al taller d'S4A
es: Introducción al taller de S4A

source: Durant aquest temps, va sorgir-li l'oportunitat d'entrar al Citilab a través d'una beca, on va desenvolupar S4A, el seu projecte final.
es: Durante este tiempo, le surgió la oportunidad de entrar al Citilab a través de una beca, donde desarrolló S4A, su proyecto final.

source: Fotoresistor i LED
es: Fotoresistor y LED

source: Descarregueu i instal·leu l'entorn Arduino seguint les instruccions de http://arduino.cc/en/Main/Software.
es: Descargad e instalad el entorno Arduino siguiendo las instrucciones de http://arduino.cc/en/Main/Software.

source: Primitives indexades canviades a primitives amb nom per a una millor compatibilitat amb les noves màquines virtuals d'Squeak (gràcies a Miriam Ruiz pel pedàs)
es: Primitivas indexadas cambiadas a primitivas con nombre para una mejor compatibilidad con las nuevas máquinas virtuales de Squeak (gracias a Miriam Ruiz por el parche)

source: Marina Conde es va diplomar en Enginyeria Tècnica en Informàtica de Gestió per la Universitat Politècnica de Catalunya (UPC) l'any 2009, on va continuar els estudis fins obtenir, l'any 2012, el títol d'Enginyeria Superior en Informàtica.
es: Marina Conde se diplomó en Ingeniería Técnica en Informática de Gestión por la Universitat Politècnica de Catalunya (UPC) en el año 2009, donde continuó los estudios hasta obtener, en 2012, el título de Ingeniería Superior en Informática.

source: Domòtica: Un controlador de persiana
es: Domótica: Un controlador de persiana

source: L'any 2009, en Bernat es va graduar com a Enginyer Tècnic en Informàtica de Gestió per la Universitat Oberta de Catalunya (UOC).
es: En el año 2009, Bernat se graduó como Ingeniero Técnico en Informática de Gestión por la Universitat Oberta de Catalunya (UOC).

source: És possible comunicar-se inalàmbricament amb una placa mitjançant un mòdul de RF, com ara Xbee.
es: Es posible comunicarse inalámbricamente con una placa mediante un módulo de RF, como Xbee.

source: És imprescindible carregar el nou firmware, així com actualitzar el bootloader en determinades plaques
es: Es imprescindible cargar el nuevo firmware, así como actualizar el bootloader en determinadas placas

source: Proporciona blocs nous per tractar amb sensors i actuadors connectats a una placa Arduino.
es: Proporciona bloques nuevos para tratar con sensores y actuadores connectados a una placa Arduino.

source: Aquí trobareu els passos detallats per a posar S4A en marxa.
es: Aquí encontraréis los pasos detallados para poner S4A en marcha.

source: Més endavant, va utilitzar aquest projecte com a base sobre la qual es va programar S4A.
es: Más adelante, utilizó este proyecto como base sobre la cual se programó S4A.

source: Afegida opció per a comprovar si hi ha actualitzacions disponibles des del menú d'ajuda.
es: Añadida opción para comprobar si hay actualizaciones disponibles desde el menú de ayuda.

source: S4A permet controlar tantes plaques com ports USB tingui el vostre PC.
es: S4A permite controlar tantas placas como puertos USB tenga vuestro PC.

source: Enviar el valor d'un sensor remot (per exemple, l'acceleròmetre del client, la posició del punter del ratolí, etc):
es: Enviar el valor de un sensor remoto (por ejemplo, el accelerómetro del cliente, la posición del puntero del ratón, etc):

source: Així que, molt probablement, funcionarà al vostre ordinador.
es: Así que, muy probablemente, funcionará en vuestro ordenador.

source: Entre d'altres, un sistema de gestió del coneixement i diverses aplicacions educatives.
es: Entre otros, un sistema de gestión del conocimiento y varias aplicaciones educativas.

source: Els components s'han de connectar d'una manera determinada.
es: Los componentes deven conectarse de una forma determinada.

source: De tota manera, a la versió final d'S4A hi ha codi que ha estat compilat, i s'hauran perdut diversos noms de variables i arguments de missatges.
es: De todas formas, a la versión final de S4A hay código que ha sido compilado, y se habrán perdido varios nombres de variables y argumentos de mensajes.

source: Carregueu el firmware a la placa mitjançant l'opció de menú Tools > Upload
es: Cargad el firmware a la placa mediante la opción de menú Tools > Upload

source: La interfície
es: La interfaz

source: Una vegada us hi hagueu subscrit, podeu enviar els vostres missatges a:
es: Una vez suscritos, podéis mandar vuestros mensajes a:

source: L'equip
es: El equipo

source: Vegeu la secció d'Android.
es: Ver sección de Android.

source: Descàrregues
es: Descargas

source: El port sèrie on es connecta una placa s'obre correctament en arrencar S4A
es: El puerto serie en qué se conecta una placa se abre correctamente al arrancar S4A

source: Un robot amb una càmera rotativa, sensors de distància i control remot.
es: Un robot con una cámara rotativa, sensores de distáncia y control remoto.

source: Enviar un missatge:
es: Enviar un mensaje:

source: Descàrrega i instal·lació
es: Descarga e instalación

source: Les variables S4A amb noms que comencin amb un signe menys (ex.
es: Las variables de S4A con nombres que empiecen con un signo menos (ej.

source: Obriu l'arxiu de firmware (S4AFirmware15.ino) des de l'entorn Arduino
es: Abrid el archivo de firmware (S4AFirmware15.ino) desde el entorno Arduino

source: Arreglat bug de la versió per a Windows, en què la barra de títol no mostrava el nom i la versió d'S4A
es: Arreglado bug de la versión para Windows, en qué la barra de título no mostraba el nombre y la versión de S4A

source: Afegit bloc de reiniciar actuadors
es: Añadido bloque de reiniciar actuadores

source: Per a veure l'API HTTP en funcionament, podeu utilitzar l'aplicació web de prova:
es: Para ver la API HTTP en funcionamento, podéis utilizar la aplicación web de prueba:

source: El seu desenvolupament el va a dur a terme l'equip d'Smalltalk del Citilab l'any 2010, i des d'aleshores s'ha utilitzat a tot el món per a una gran varietat de projectes.
es: Fue desarrollado por el equipo de Smalltalk del Citilab en el año 2010, y desde entonces se ha usado en todo el mundo para una gran variedad de proyectos.

source: Afegida compatibilitat per a aplicacions Android (HiS4A)
es: Añadida compatibilidad para aplicaciones Android (HiS4A)

source: Què és
es: Acerca

source: Preguntes més freqüents
es: Preguntas más frecuentes

source: Per utilitzar-lo, seguiu aquestes instruccions:
es: Para utilizarlo, seguid estas instrucciones:

source: Els botons corresponen a missatges, i el touchpad i lliscador a sensors remots
es: Los botones se corresponden con mensajes, y el touchpad y deslizador a sensores remotos

source: S4A és programari lliure subjecte a una llicència MIT.
es: S4A es software libre sujeto a una licencia MIT.

source: Només cal afegir un nou sprite Arduino.
es: Sólo es necesario añadir un nuevo sprite Arduino.

source: En Jose va estudiar Enginyeria Superior en Telecomunicacions, però va començar a treballar a una editorial abans d'acabar els estudis.
es: Jose estudió Inginiería Superior en Telecomunicaciones, pero empezó a trabajar en una editorial andes de terminar los estudios.

source: En S4A, una placa Arduino es representa amb un tipus especial d'sprite.
es: En S4A, una placa Arduino se representa con un tipo especial de sprite.

source: Per a subscriure-us-hi, envieu un correu a:
es: Para suscribiros, enviad un correo a:

source: Ja no cal visitar la web per a comprovar-ho
es: Ya no hace falta visitar la web para comprobarlo

source: Robot complet
es: Robot completo

source: S4A funciona sobre els tres sistemes operatius d'escriptori més populars: Microsoft Windows, GNU/Linux and MacOS.
es: S4A funciona sobre los tres sistemas operativos de escritorio más populares: Microsoft Windows, GNU/Linux and MacOS.

source: L'idioma es detecta automàticament en arrencar per primer cop (quan l'arxiu Scratch.ini no existeix).
es: El idioma se detecta automáticamente al arrancar por primera vez (cuando el archivo Scratch.ini no existe).

source: Ara és possible enviar missatges a S4A i observar/modificar valors de variables des d'un navegador web (entre altres coses).
es: Ahora es posible mandar mensajes a S4A y observar/modificar valores de variables desde un navegador web (entre otras cosas).

source: S4A interactua amb Arduino enviant l'estat dels actuadors i rebent l'estat dels sensors cada 75 ms, per tant l'amplada del pols ha de ser major que aquest període.
es: S4A interactúa con Arduino enviando el estado de los actuadores y recibiendo el estado de los sensores cada 75 ms, por lo tanto el ancho del pulso tiene que ser mayor que éste período.

source: Canvis
es: Cambios

source: CA ES PT
es: CA EN PT

source: Al Citilab, va descobrir Scratch i Smalltalk, reemprenent part de la seva feina com a programador.
es: En el Citilab, descubrió Scratch y Smalltalk, retomando parte de su trabajo como programador.

source: El seu primer projecte final va consistir en desenvolupar un entorn per a treballar amb plaques Arduino des de l'entorn d'Smalltalk Pharo.
es: Su primer proyecto final consistió en desarrollar un entorno para trabajar con placas Arduino desde el entorno de Smalltalk Pharo.

source: Què és S4A
es: Acerca de S4A

source: Ús de l'aplicació web d'exemple:
es: Uso de la aplicación web de ejemplo:

source: La finalitat principal del projecte és atreure gent al món de la programació.
es: La finalidad principal del proyecto es atraer a gente al mundo de la programación.

source: Es poden connectar múltiples plaques alhora.
es: Pueden conectarse múltiples placas a la vez.

source: Contacte
es: Contacto

source: Scratch for Arduino (S4A) és una versió modificada d'Scratch, preparada per a interactuar amb plaques Arduino.
es: Scratch for Arduino (S4A) es una versión modificada de Scratch, preparada para interactuar con placas Arduino.

source: Com utilitzar un LED RGB des d'Scratch.
es: Como usar un LED RGB desde Scratch.

source: Afegida compatibilitat completa amb el protocol HTTP (POST i GET).
es: Añadida compatibilidad completa con el protocolo HTTP (POST y GET).

source: Alguns d'aquests vídeos també han estat subtitulats a l'anglès.
es: Algunos de estos vídeos también han sido subtitulados al inglés.

source: Canviat el pin per defecte dels blocs digital on/off de 13 a 10
es: Cambiado el pin por defecto de los bloques digital on/off de 13 a 10

source: +nomJugador) són visibles i modificables des del client web
es: +nombreJugador) son visibles y modificables desde el cliente web

source: Podeu decarregar-vos-el des d'aquí, o escanejant aquest codi QR:
es: Os lo podéis descargar desde aquí, o escaneando este código QR:

source: S4A funciona correctament amb Arduino Diecimila, Duemilanove i Uno.
es: S4A funciona correctamente con Arduino Diecimila, Duemilanove y Uno.

source: Per a programadors
es: Para programadores

source: A HiS4A (Android), introduïu la IP local del PC on tingueu S4A funcionant (podeu trobar-la des del menú Edita > Host de xarxa), més el prefix (només necessari si us esteu connectant des de més d'un client d'Android)
es: En HiS4A (Android), introducid la IP local del PC en qué S4A esté funcionando (la podéis encontrar desde el menú Editar > Host de red), y continuación el prefjo (sólo necesario si os estáis conectando desde más de un cliente de Android)

source: Els objectes Arduino proporcionen blocs per a les funcionalitats bàsiques del micro-controlador, escriptures i lectures digitals i analògiques, i altres funcionalitats de més alt nivell.
es: Los objetos Arduino proporcionan bloques para las funcionalidades básicas del micro-controlador, escrituras y lecturas digitales y analógicas, y otras funcionalidades de más alto nivel.

source: També es desa en aquest mateix arxiu en canviar-se des del menú d'idioma
es: También se guarda en este mismo archivo al cambiarse desde el menú de idioma

source: Abans de res, cal activar l'opció de sensors remots a S4A (clic dret a qualsevol bloc de "Sensors").
es: En primer lugar, debe activarse la opción de sensores remotos en S4A (clic derecho en cualquier bloque de "Sensores").
